#Question no 1

In [1]:
import pandas as pd

In [2]:
pip install pd

Requirement already satisfied: pd in /opt/conda/lib/python3.10/site-packages (0.0.4)
Note: you may need to restart the kernel to use updated packages.

In [17]:
l1 = ['4','8','15','16','23','42']

In [22]:
st = pd.Series(l1)
print(st)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: object

#Question no 2

In [23]:
l2 = ['raghav' , 'shyam' , 'raju']

In [24]:
variable = pd.Series(l2)
print(variable)

0    raghav
1     shyam
2      raju
dtype: object

#Qustion 3

In [36]:
import csv
R =[ ["Name" , "Age" , "Gender"],
     ['Alice', '25' , 'Female'],
     ['Bob' , '30' , 'Male'],
     ['Claire' '27', 'Female'],
]

In [40]:
with open("datatype_csv", "w" ) as f :
    writer = csv.writer(f)
    
    for i in R:
        writer.writerow(i)

In [42]:
dt = pd.read_csv("datatype_csv")

In [43]:
dt.head()

       Name     Age  Gender
0     Alice      25  Female
1       Bob      30    Male
2  Claire27  Female     NaN

#Qustion 4

#"Data frame is a structure way of data "
#"Data frame is a two-dimensional structure with columns and rows whose size can be changed on the other hand The Series object provides encapsulation for each of the column data "

#Question no 5

#functions are head , tail , columns

In [45]:
dt.tail(2)

       Name     Age Gender
1       Bob      30   Male
2  Claire27  Female    NaN

In [47]:
dt.columns

Index(['Name', 'Age', 'Gender'], dtype='object')

In [48]:
dt.head()

       Name     Age  Gender
0     Alice      25  Female
1       Bob      30    Male
2  Claire27  Female     NaN

#Question no 6

#'Data frame is mutable in nature series

#Question non 7

In [49]:
import csv
data = [ ["name" , "email_id" , "phone" ],
         ["suraj", "suraj@gmial.com", 984561285],
         ["krish", "krish@gmial.com" , 879456123],
         ["Ravi" , "ravi#gmial.com" , 78456123085],
         ["sunil" , "sunil@gmail.com", 79845612956],
         ["furw" , "fdjm#gmaiacom" , 7984561235],
         ["hgb" , "etgfdetgfs@gmai.com" ,9846512562]
            
]

In [50]:
with open("service.csv", "w" ) as f :
    writer = csv.writer(f)
    
    for i in data:
        writer.writerow(i)